Revit 2027 API
RevisionNumberingSequence.SequenceName Property
 The name of this revision numbering sequence.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string SequenceName { get; set; }
Public Property SequenceName As String
	Get
	Set
public:
property String^ SequenceName {
	String^ get ();
	void set (String^ value);
}
member SequenceName : string with get, set
Property Value
String
Exceptions
Exception | Condition
ArgumentException |  When setting this property: sequenceName is an empty string or contains only whitespace. -or- When setting this property: sequenceName cannot include prohibited characters, such as "{, }, [, ], |, ;, less-than sign, greater-than sign, ?, `, ~".
ArgumentNullException |  When setting this property: A non-optional argument was null
Remarks
 This name appears in the Sheet Issues/Revisions dialog as a numbering choice for each revision.
See Also
Reference
RevisionNumberingSequence Class
Autodesk.Revit.DB Namespace